<template>
<el-backtop :right="60" :bottom="100" style='background-color: #000000;color:white' />
  <el-breadcrumb :separator-icon="ArrowRight" class="breadcrumb">
    <el-breadcrumb-item :to="{
        path:'/private/diary',
        query:{page:fromPage}
    }
    ">diary</el-breadcrumb-item>
    <el-breadcrumb-item>{{title}}</el-breadcrumb-item>
  </el-breadcrumb>
    <h1 id="title">{{title}}</h1>
  <div id="content">
    <p>《最强大脑》水哥王昱珩中日PK赢了之后，说：“我觉得今天扇子的数量，对我来讲是比较少的。如果这是30万把扇子的话，可能更适合我。我以前看过一把扇子全是文字，合上以后是一把空白的扇子。”</p>
    <p>当天《最强大脑》播出后，很多网友在网上大骂水哥：“太不尊重对手了。”“太自以为是了，太狂妄了。”</p>
    <p>但有一个网友特别懂水哥，他在微博上评论说：“有一只折扇叫做历史，这只折扇上写满了30万华人的名字，可日本人却想把它折叠起来，使它变成一片空白……”</p>
    <p>水哥转发了这条评论，“我在场上说曾经有一把满是字的折扇时，几度忍住……不曾想竟有人听懂，内心良久不能平静。</p>
        <p>《最强大脑》水哥王昱珩中日PK赢了之后，说：“我觉得今天扇子的数量，对我来讲是比较少的。如果这是30万把扇子的话，可能更适合我。我以前看过一把扇子全是文字，合上以后是一把空白的扇子。”</p>
    <p>当天《最强大脑》播出后，很多网友在网上大骂水哥：“太不尊重对手了。”“太自以为是了，太狂妄了。”</p>
    <p>但有一个网友特别懂水哥，他在微博上评论说：“有一只折扇叫做历史，这只折扇上写满了30万华人的名字，可日本人却想把它折叠起来，使它变成一片空白……”</p>
    <p>水哥转发了这条评论，“我在场上说曾经有一把满是字的折扇时，几度忍住……不曾想竟有人听懂，内心良久不能平静。</p>
        <p>《最强大脑》水哥王昱珩中日PK赢了之后，说：“我觉得今天扇子的数量，对我来讲是比较少的。如果这是30万把扇子的话，可能更适合我。我以前看过一把扇子全是文字，合上以后是一把空白的扇子。”</p>
    <p>当天《最强大脑》播出后，很多网友在网上大骂水哥：“太不尊重对手了。”“太自以为是了，太狂妄了。”</p>
    <p>但有一个网友特别懂水哥，他在微博上评论说：“有一只折扇叫做历史，这只折扇上写满了30万华人的名字，可日本人却想把它折叠起来，使它变成一片空白……”</p>
    <p>水哥转发了这条评论，“我在场上说曾经有一把满是字的折扇时，几度忍住……不曾想竟有人听懂，内心良久不能平静。</p>
        <p>《最强大脑》水哥王昱珩中日PK赢了之后，说：“我觉得今天扇子的数量，对我来讲是比较少的。如果这是30万把扇子的话，可能更适合我。我以前看过一把扇子全是文字，合上以后是一把空白的扇子。”</p>
    <p>当天《最强大脑》播出后，很多网友在网上大骂水哥：“太不尊重对手了。”“太自以为是了，太狂妄了。”</p>
    <p>但有一个网友特别懂水哥，他在微博上评论说：“有一只折扇叫做历史，这只折扇上写满了30万华人的名字，可日本人却想把它折叠起来，使它变成一片空白……”</p>
    <p>水哥转发了这条评论，“我在场上说曾经有一把满是字的折扇时，几度忍住……不曾想竟有人听懂，内心良久不能平静。</p>
        <p>《最强大脑》水哥王昱珩中日PK赢了之后，说：“我觉得今天扇子的数量，对我来讲是比较少的。如果这是30万把扇子的话，可能更适合我。我以前看过一把扇子全是文字，合上以后是一把空白的扇子。”</p>
    <p>当天《最强大脑》播出后，很多网友在网上大骂水哥：“太不尊重对手了。”“太自以为是了，太狂妄了。”</p>
    <p>但有一个网友特别懂水哥，他在微博上评论说：“有一只折扇叫做历史，这只折扇上写满了30万华人的名字，可日本人却想把它折叠起来，使它变成一片空白……”</p>
    <p>水哥转发了这条评论，“我在场上说曾经有一把满是字的折扇时，几度忍住……不曾想竟有人听懂，内心良久不能平静。</p>
        <p>《最强大脑》水哥王昱珩中日PK赢了之后，说：“我觉得今天扇子的数量，对我来讲是比较少的。如果这是30万把扇子的话，可能更适合我。我以前看过一把扇子全是文字，合上以后是一把空白的扇子。”</p>
    <p>当天《最强大脑》播出后，很多网友在网上大骂水哥：“太不尊重对手了。”“太自以为是了，太狂妄了。”</p>
    <p>但有一个网友特别懂水哥，他在微博上评论说：“有一只折扇叫做历史，这只折扇上写满了30万华人的名字，可日本人却想把它折叠起来，使它变成一片空白……”</p>
    <p>水哥转发了这条评论，“我在场上说曾经有一把满是字的折扇时，几度忍住……不曾想竟有人听懂，内心良久不能平静。</p>
    <!-- <p>{{id}}</p> -->
  </div>
</template>

<script>
import { ArrowRight } from '@element-plus/icons-vue'
import {inject} from "vue"
export default {
    props:["id",'fromPage',"title"],
    setup(props){
        console.log(props)
        const swichToDiaryPage=inject('swichToDiaryPage')
        return {ArrowRight,swichToDiaryPage}
    }
}
</script>

<style scoped>
    #content {
        margin-top:10px ;
        width: 1000px;
        position: relative;
        /* top: 50px; */
        left: 50%;
        transform: translate(-50%,0);
        font-size: 18px;
        margin-bottom: 120px;
    }
    #title{
        width: 1000px;
        margin-top:10px ;
        position: relative;
        /* top: 50px; */
        left: 50%;
        transform: translate(-50%,0);
        /* font-size: 18px; */
        text-align: center;
    }
    .breadcrumb{
        position: relative;
        top: 20px;
        left: 20px;
        width: 100px;
    }
</style>